http/results/retro-lwt-effects-uring-R5000.txt
Running 20s test @ http://127.0.0.1:18960/
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.590ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.455ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.624ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.491ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms    0.96ms   6.74ms   73.28%
    Req/Sec     1.32k   604.32     2.78k    75.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.59ms
 75.000%    2.21ms
 90.000%    3.06ms
 99.000%    4.91ms
 99.900%    5.87ms
 99.990%    6.41ms
 99.999%    6.75ms
100.000%    6.75ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.111     0.000000            1         1.00
       0.754     0.100000         4950         1.11
       0.992     0.200000         9882         1.25
       1.211     0.300000        14825         1.43
       1.400     0.400000        19765         1.67
       1.586     0.500000        24701         2.00
       1.685     0.550000        27159         2.22
       1.795     0.600000        29629         2.50
       1.918     0.650000        32091         2.86
       2.057     0.700000        34563         3.33
       2.213     0.750000        37040         4.00
       2.307     0.775000        38291         4.44
       2.407     0.800000        39505         5.00
       2.525     0.825000        40732         5.71
       2.667     0.850000        41968         6.67
       2.849     0.875000        43194         8.00
       2.953     0.887500        43819         8.89
       3.061     0.900000        44437        10.00
       3.189     0.912500        45047        11.43
       3.349     0.925000        45665        13.33
       3.531     0.937500        46283        16.00
       3.633     0.943750        46591        17.78
       3.747     0.950000        46898        20.00
       3.875     0.956250        47205        22.86
       4.017     0.962500        47516        26.67
       4.167     0.968750        47825        32.00
       4.259     0.971875        47978        35.56
       4.351     0.975000        48132        40.00
       4.439     0.978125        48285        45.71
       4.543     0.981250        48440        53.33
       4.651     0.984375        48594        64.00
       4.719     0.985938        48675        71.11
       4.795     0.987500        48753        80.00
       4.875     0.989062        48832        91.43
       4.959     0.990625        48907       106.67
       5.043     0.992188        48982       128.00
       5.095     0.992969        49022       142.22
       5.151     0.993750        49060       160.00
       5.199     0.994531        49096       182.86
       5.271     0.995313        49133       213.33
       5.351     0.996094        49172       256.00
       5.411     0.996484        49191       284.44
       5.459     0.996875        49210       320.00
       5.511     0.997266        49230       365.71
       5.583     0.997656        49249       426.67
       5.639     0.998047        49269       512.00
       5.691     0.998242        49279       568.89
       5.739     0.998437        49287       640.00
       5.791     0.998633        49300       731.43
       5.843     0.998828        49309       853.33
       5.879     0.999023        49317      1024.00
       5.907     0.999121        49321      1137.78
       5.951     0.999219        49327      1280.00
       5.991     0.999316        49331      1462.86
       6.027     0.999414        49336      1706.67
       6.063     0.999512        49341      2048.00
       6.071     0.999561        49343      2275.56
       6.095     0.999609        49345      2560.00
       6.119     0.999658        49348      2925.71
       6.151     0.999707        49350      3413.33
       6.267     0.999756        49352      4096.00
       6.279     0.999780        49354      4551.11
       6.315     0.999805        49355      5120.00
       6.319     0.999829        49356      5851.43
       6.327     0.999854        49357      6826.67
       6.399     0.999878        49358      8192.00
       6.407     0.999890        49359      9102.22
       6.411     0.999902        49360     10240.00
       6.411     0.999915        49360     11702.86
       6.495     0.999927        49361     13653.33
       6.495     0.999939        49361     16384.00
       6.631     0.999945        49362     18204.44
       6.631     0.999951        49362     20480.00
       6.631     0.999957        49362     23405.71
       6.651     0.999963        49363     27306.67
       6.651     0.999969        49363     32768.00
       6.651     0.999973        49363     36408.89
       6.651     0.999976        49363     40960.00
       6.651     0.999979        49363     46811.43
       6.747     0.999982        49364     54613.33
       6.747     1.000000        49364          inf
#[Mean    =        1.779, StdDeviation   =        0.959]
#[Max     =        6.744, Total count    =        49364]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  98551 requests in 20.00s, 199.06MB read
Requests/sec:   4927.31
Transfer/sec:      9.95MB

JSON Output:
{
	"requests": 98551,
	"duration_in_microseconds": 20000994.00,
	"bytes": 208731018,
	"requests_per_sec": 4927.31,
	"bytes_transfer_per_sec": 10436032.23,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1586
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2213
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 3061
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 4915
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 5871
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 6407
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 6747
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 6747
		}
	]
}