http/results/retro2-classic-libev-R10000-r1.txt
Running 20s test @ http://127.0.0.1:19219/
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.544ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.120ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.200ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.490ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.30ms    2.40ms  19.47ms   88.82%
    Req/Sec     2.63k   727.38     6.33k    80.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.53ms
 75.000%    2.26ms
 90.000%    5.41ms
 99.000%   11.73ms
 99.900%   15.14ms
 99.990%   17.92ms
 99.999%   19.42ms
100.000%   19.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.112     0.000000            1         1.00
       0.684     0.100000         9873         1.11
       0.917     0.200000        19745         1.25
       1.121     0.300000        29648         1.43
       1.318     0.400000        39524         1.67
       1.534     0.500000        49377         2.00
       1.650     0.550000        54293         2.22
       1.771     0.600000        59231         2.50
       1.906     0.650000        64197         2.86
       2.059     0.700000        69112         3.33
       2.257     0.750000        74044         4.00
       2.387     0.775000        76514         4.44
       2.563     0.800000        78974         5.00
       2.821     0.825000        81445         5.71
       3.213     0.850000        83916         6.67
       3.973     0.875000        86375         8.00
       4.659     0.887500        87608         8.89
       5.411     0.900000        88842        10.00
       6.163     0.912500        90078        11.43
       6.919     0.925000        91313        13.33
       7.619     0.937500        92551        16.00
       7.959     0.943750        93161        17.78
       8.303     0.950000        93778        20.00
       8.655     0.956250        94401        22.86
       9.071     0.962500        95018        26.67
       9.535     0.968750        95632        32.00
       9.799     0.971875        95943        35.56
      10.095     0.975000        96253        40.00
      10.367     0.978125        96555        45.71
      10.671     0.981250        96865        53.33
      11.007     0.984375        97174        64.00
      11.183     0.985938        97325        71.11
      11.383     0.987500        97480        80.00
      11.599     0.989062        97639        91.43
      11.847     0.990625        97794       106.67
      12.103     0.992188        97944       128.00
      12.279     0.992969        98020       142.22
      12.471     0.993750        98097       160.00
      12.759     0.994531        98175       182.86
      13.023     0.995313        98252       213.33
      13.231     0.996094        98328       256.00
      13.535     0.996484        98366       284.44
      13.695     0.996875        98405       320.00
      13.847     0.997266        98445       365.71
      14.063     0.997656        98483       426.67
      14.343     0.998047        98522       512.00
      14.471     0.998242        98540       568.89
      14.639     0.998437        98559       640.00
      14.783     0.998633        98579       731.43
      14.951     0.998828        98598       853.33
      15.231     0.999023        98618      1024.00
      15.375     0.999121        98628      1137.78
      15.583     0.999219        98636      1280.00
      15.727     0.999316        98647      1462.86
      15.879     0.999414        98656      1706.67
      16.039     0.999512        98665      2048.00
      16.159     0.999561        98672      2275.56
      16.255     0.999609        98675      2560.00
      16.607     0.999658        98680      2925.71
      16.911     0.999707        98685      3413.33
      17.103     0.999756        98689      4096.00
      17.215     0.999780        98692      4551.11
      17.391     0.999805        98694      5120.00
      17.487     0.999829        98697      5851.43
      17.647     0.999854        98699      6826.67
      17.823     0.999878        98701      8192.00
      17.919     0.999890        98703      9102.22
      17.967     0.999902        98704     10240.00
      17.983     0.999915        98705     11702.86
      18.079     0.999927        98706     13653.33
      18.287     0.999939        98707     16384.00
      18.335     0.999945        98708     18204.44
      19.311     0.999951        98709     20480.00
      19.311     0.999957        98709     23405.71
      19.359     0.999963        98710     27306.67
      19.359     0.999969        98710     32768.00
      19.375     0.999973        98711     36408.89
      19.375     0.999976        98711     40960.00
      19.375     0.999979        98711     46811.43
      19.423     0.999982        98712     54613.33
      19.423     0.999985        98712     65536.00
      19.423     0.999986        98712     72817.78
      19.423     0.999988        98712     81920.00
      19.423     0.999989        98712     93622.86
      19.487     0.999991        98713    109226.67
      19.487     1.000000        98713          inf
#[Mean    =        2.296, StdDeviation   =        2.395]
#[Max     =       19.472, Total count    =        98713]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  194711 requests in 20.00s, 393.29MB read
Requests/sec:   9734.26
Transfer/sec:     19.66MB

JSON Output:
{
	"requests": 194711,
	"duration_in_microseconds": 20002648.00,
	"bytes": 412397898,
	"requests_per_sec": 9734.26,
	"bytes_transfer_per_sec": 20617165.19,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1534
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2257
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 5411
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 11735
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 15135
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 17919
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 19423
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 19487
		}
	]
}